tap "homeport/tap"

brew "actionlint"
brew "ansible"
brew "ansible-lint"
brew "atmos"
brew "atuin"
brew "awscli"
brew "bat"
brew "bundler-completion"
brew "commitlint"
brew "dash-shell"
brew "direnv"
brew "dockutil"
brew "docker-compose"
brew "docker-credential-helper"
brew "eza"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "helm"
brew "helm-ls"
brew "hk"
brew "homeport/tap/dyff"
brew "imagemagick"
brew "jsonlint"
brew "k9s"
brew "kubernetes-cli"
brew "libb2"
brew "libpq"
brew "libxml2"
brew "markdownlint-cli2"
brew "mas"
brew "mise"
brew "nmap"
brew "node"
brew "openssl@3"
brew "opentofu"
brew "overmind"
brew "pipx"
brew "playwright-cli"
brew "powershell"
brew "redis"
brew "ripgrep"
brew "shellcheck"
brew "starship"
brew "the_silver_searcher"
brew "uv"
brew "vips"
brew "vite"
brew "watchman"
brew "wget"
brew "yamllint"
brew "yq"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

cask "1password"
cask "1password-cli"
cask "bruno"
cask "canva"
cask "cardhop"
cask "claude"
cask "conductor"
cask "fantastical"
cask "figma"
cask "font-ia-writer-duo"
cask "font-ia-writer-mono"
cask "font-ia-writer-quattro"
cask "font-iosevka"
cask "font-maple-mono"
cask "font-maple-mono-nf"
cask "font-zed-mono-nerd-font"
cask "ghostty"
cask "kap"
cask "microsoft-excel"
cask "microsoft-outlook"
cask "microsoft-powerpoint"
cask "microsoft-word"
cask "numi"
cask "omnigraffle"
cask "omnioutliner"
cask "orbstack"
cask "postgres-app"
cask "rectangle-pro"
cask "setapp"
cask "slack"
cask "the-unarchiver"
cask "whatsapp"
cask "zed@preview"
cask "zen@twilight"

mas "1Password for Safari", id: 1569813296
mas "Anybox", id: 1593408455
mas "Bear", id: 1091189122
mas "Drafts", id: 1435957248
mas "FireShot - Full web page screenshots", id: 1541862561
mas "GarageBand", id: 682658836
mas "Goodnotes", id: 1444383602
mas "iMovie", id: 408981434
mas "InYourFace", id: 1476964367
mas "Mela", id: 1568924476
mas "Msg Viewer Pro", id: 1019539949
mas "Prime Video", id: 545519333
mas "SnippetsLab", id: 1006087419
mas "Sofa", id: 1276554886
mas "TestFlight", id: 899247664
mas "UK Salary Calculator", id: 505795901
mas "Under My Roof", id: 1524335878
mas "Wipr", id: 1662217862
mas "Xcode", id: 497799835
cask "sorkila/lockpaw/lockpaw"
mas "Cardhop", id: 1290358394
mas "Fantastical", id: 975937182
brew "atuin", restart_service: :changed
brew "cmake"
brew "coreutils"
brew "curl"
brew "displayplacer"
brew "fx"
brew "gemini-cli"
brew "hub"
brew "jq"
brew "nano"
brew "pandoc"
brew "ssh-copy-id"
brew "tailscale"
brew "thefuck"
brew "tmux"
brew "yarn"
brew "youtubedr"
brew "yt-dlp"
brew "zsh-completions"
cask "beardedspice"
cask "cleanshot"
cask "codex"
cask "copilot-cli"
cask "db-browser-for-sqlite"
cask "git-credential-manager"
cask "github"
cask "google-chrome"
cask "jordanbaird-ice"
cask "m13v/tap/claude-meter", trusted: true
cask "microsoft-teams"
cask "mole-app"
cask "pgadmin4"
cask "pieces-os"
cask "pieces"
cask "proton-mail-bridge"
cask "protonvpn"
cask "raycast"
cask "readdle-spark"
cask "tailscale-app"
cask "taphouse"
cask "zoom"
mas "Expenses", id: 1492055171
mas "Keynote", id: 361285480
mas "NotePlan", id: 1505432629
mas "Numbers", id: 361304891
mas "Pages", id: 361309726
tap "homebrew/cask"
tap "m13v/tap"
tap "sorkila/lockpaw"
