tap "common-fate/granted"
tap "hashicorp/tap"
tap "homeport/tap"
tap "jdx/tap"
tap "stripe/stripe-cli"

brew "actionlint"
brew "ansible"
brew "ansible-lint"
brew "atmos"
brew "atuin"
brew "awscli"
brew "bat"
brew "bundler-completion"
brew "commitlint"
brew "common-fate/granted/granted"
brew "dash-shell"
brew "direnv"
brew "dockutil"
brew "docker"
brew "docker-compose"
brew "docker-credential-helper"
brew "eza"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "helm"
brew "helm-ls"
brew "hk"
brew "homeport/tap/dyff"
brew "imagemagick"
brew "jsonlint"
brew "k9s"
brew "kubernetes-cli"
brew "libb2"
brew "libpq"
brew "libxml2"
brew "markdownlint-cli2"
brew "mas"
brew "mise"
brew "nmap"
brew "node"
brew "openssl@3"
brew "opentofu"
brew "overmind"
brew "pipx"
brew "playwright-cli"
brew "postgresql@16"
brew "postgresql@17"
brew "powershell"
brew "redis"
brew "ripgrep"
brew "shellcheck"
brew "starship"
brew "stripe/stripe-cli/stripe"
brew "the_silver_searcher"
brew "uv"
brew "vips"
brew "vite"
brew "watchman"
brew "wget"
brew "yamllint"
brew "yq"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

cask "1password"
cask "1password-cli"
cask "bruno"
cask "canva"
cask "cardhop"
cask "claude"
cask "conductor"
cask "fantastical"
cask "figma"
cask "font-ia-writer-duo"
cask "font-ia-writer-mono"
cask "font-ia-writer-quattro"
cask "font-iosevka"
cask "font-maple-mono"
cask "font-maple-mono-nf"
cask "font-zed-mono-nerd-font"
cask "ghostty"
cask "kap"
cask "microsoft-excel"
cask "microsoft-outlook"
cask "microsoft-powerpoint"
cask "microsoft-word"
cask "numi"
cask "omnigraffle"
cask "omnioutliner"
cask "orbstack"
cask "postgres-app"
cask "rectangle-pro"
cask "setapp"
cask "slack"
cask "the-unarchiver"
cask "whatsapp"
cask "zed@preview"

mas "1Password for Safari", id: 1569813296
mas "Anybox", id: 1593408455
mas "Bear", id: 1091189122
mas "Drafts", id: 1435957248
mas "FireShot - Full web page screenshots", id: 1541862561
mas "GarageBand", id: 682658836
mas "Goodnotes", id: 1444383602
mas "iMovie", id: 408981434
mas "InYourFace", id: 1476964367
mas "Mela", id: 1568924476
mas "Msg Viewer Pro", id: 1019539949
mas "Prime Video", id: 545519333
mas "SnippetsLab", id: 1006087419
mas "Sofa", id: 1276554886
mas "TestFlight", id: 899247664
mas "UK Salary Calculator", id: 505795901
mas "Under My Roof", id: 1524335878
mas "Wipr", id: 1662217862
mas "Xcode", id: 497799835
cask "sorkila/lockpaw/lockpaw"
mas "Cardhop", id: 1290358394
mas "Fantastical", id: 975937182
mas "Microsoft Excel", id: 462058435
mas "Microsoft Outlook", id: 985367838
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
