tap "homebrew/services"
tap "buo/cask-upgrade"
brew "mas"

brew "atuin" # Shell history
brew "chezmoi" # Chezmoi is a dotfile manager
brew "duti" # Duti is a tool for setting default applications for file types
brew "gmp" # GNU Multiple Precision Arithmetic Library
brew "gh" # GitHub CLI
brew "gnupg" # GnuPG is a complete and free implementation of the OpenPGP standard
brew "libxml2" # XML parser library
brew "libyaml" # YAML parser library
brew "mas" # Mac App Store CLI
brew "mise" # Version manager
brew "obsidian" # Obsidian is a note-taking app
brew "ollama", restart_service: :changed # Ollama is a tool for running large language models locally
brew "openssl@3" # OpenSSL
brew "readline" # Readline is a library for editing command lines as they are typed
brew "redis", restart_service: :changed # Redis is an open-source, in-memory data structure store
brew "shellcheck" # ShellCheck is a static analysis tool for shell scripts
brew "the_silver_searcher" # The Silver Searcher is a code-searching tool similar to ack and ag
brew "tree" # Tree is a recursive directory listing program that produces a depth indented listing of files
brew "vips" # VIPS is a powerful image processing library
brew "watchman" # Watchman is a tool for watching changes in files and directories
brew "zsh-autocomplete" # Zsh-autocomplete is a plugin for zsh that provides auto-completion for commands and options
brew "zsh-syntax-highlighting" # Zsh-syntax-highlighting

cask "1password" # 1Password is a password manager
cask "affinity-designer" # Affinity Designer is a vector graphics editor
cask "affinity-photo" # Affinity Photo is a raster graphics editor
cask "affinity-publisher" # Affinity Publisher is a desktop publishing tool
cask "applite" # Applite is a tool for managing applications from Cask
cask "basecamp" # Basecamp is a project management tool
cask "balenaetcher" # BalenaEtcher is a tool for flashing images to USB drives
cask "bruno" # Bruno is a tool for making HTTP requests
cask "figma" # Figma is a collaborative design tool
cask "github" # GitHub UI client
cask "ghostty" # Terminal
cask "iina" # Media player for macOS
cask "kap" # Screen recording tool
cask "microsoft-teams" # Microsoft Teams is a collaboration tool
cask "netnewswire" # NetNewsWire is a RSS reader
cask "raspberry-pi-imager" # For flashing images to Raspberry Pi SD cards
cask "raycast" # Launcher for macOS
cask "numi" # Calculator for macOS
cask "orbstack" # Orbstack is a tool for managing Docker containers
cask "rectangle-pro" # Window management tool
cask "setapp" # Setapp is a platform for other apps
cask "syncalicious" # Syncalicious is a tool for syncing files between devices
cask "tableplus" # TablePlus is a database management tool
cask "tailscale" # Tailscale is a VPN for the internet
cask "the-unarchiver" # Better file extraction tool
cask "zed" # Zed is a text and code editor
cask "zoom" # Zoom is a video conferencing tool

mas "1Password for Safari", id: 1569813296 # 1Password for Safari
mas "Anybox", id: 1593408455 # Bookmarks
mas "Bear", id: 1091189122 # Notes
mas "Canva", id: 897446215 # Design
mas "Fantastical", id: 975937182 # Calendar
mas "Home Assistant", id: 1099568401 # Smart Home
mas "Ivory", id: 6444602274 # Mastodon
mas "Keynote", id: 409183694 # Presentations
mas "Microsoft Excel", id: 462058435 # Spreadsheets
mas "Microsoft Outlook", id: 985367838 # Microsoft 365 Email
mas "Microsoft Word", id: 462054704 # Documents
mas "Msg Viewer Pro", id: 1019539949 # Open .eml files
mas "Notability: Smarter AI Notes", id: 360593530 # Notability is a note-taking app
mas "Numbers", id: 409203825 # Spreadsheets
mas "Pages", id: 409201541 # Documents
mas "Prime Video", id: 545519333 # Video Streaming
mas "Shapr3D", id: 1091675654 # 3D Modeling
mas "Slack", id: 803453959 # Slack
mas "Sofa", id: 1276554886 # To-Watch List
mas "Things", id: 904280696 # To-Do List
mas "Ulysses", id: 1225570693 # Writing
mas "Under My Roof", id: 1524335878 # Home Inventory
mas "WhatsApp", id: 310633997 # Chat
mas "Xcode", id: 497799835 # Development

# mas "Final Cut Pro", id: 424389933 # Video Editing
# mas "GarageBand", id: 682658836 # Music Production
# mas "iMovie", id: 408981434 # Video Editing
